/*#######################################################################################

    后台通用工具函数组件

    Version: V0.8
    Author: SolitudeRA
    Github: @SolitudeRA
    Mail: solitudera@outlook.com

#########################################################################################*/

/*========================================================================================

    窗口/标签页管理函数

=========================================================================================*/

/* ========================================== 刷新标签页 ========================================== */

async function reloadTabBackend(tabID) {
    return new Promise((resolve) => {
        chrome.tabs.reload(tabID, {}, function () {
            resolve();
        })
    });
}

/* ========================================== 关闭标签页 ========================================== */
async function removeTab(tabID) {
    return new Promise((resolve) => {
        chrome.tabs.remove(tabID, function () {
            resolve();
        });
    });
}